Autodesk.Revit.DB.Mechanical.ComponentClassification
An enumerated type lists all MEP component classification. This attribute describes the general purpose of the MEP part component, that is used for scheduling, tagging, filter, ODBC, and etc.
One component classification may include more than one part type.

Autodesk.Revit.DB.Mechanical.ComponentClassification.Sleeve
Sleeve (supports) component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Hanger
Hanger (supports) component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Sensor
Sensor component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Valve
Valve component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Wye
Wye component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Flange
Flange component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Union
Union component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Coupling
Coupling component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Endcap
Cap component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Cross
Cross component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Transition
Transition component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Tap
Cap component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Tee
Tee component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Elbow
Elbow component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.FlexDuct
Flex duct curve component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.FlexPipe
Flex pipe curve component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Duct
Straight duct segment component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Pipe
Straight pipe segment component classification

Autodesk.Revit.DB.Mechanical.ComponentClassification.Undefined
Undefined component classification